# Core
brew "neovim"
brew "git"
brew "curl"
brew "ripgrep"
brew "fd"
brew "gnu-sed"

# Build tools (Treesitter parsers, native deps)
brew "cmake"
brew "ninja"
brew "pkg-config"
brew "tree-sitter"

# LSP / formatting helpers
brew "stylua"
brew "black"
brew "isort"
brew "prettier"

# Language servers (common)
brew "lua-language-server"
brew "pyright"
brew "texlab"

# Python + R
brew "python"
brew "r"

# LaTeX toolchain (choose ONE path below)
# Option A (lighter): TeX Live via brew
brew "texlive"
brew "latexmk"

# Option B (heavier but classic): MacTeX (comment out texlive+latexmk above if you use this)
# cask "mactex-no-gui"

# PDF viewer (you prefer Skim)
cask "skim"

# Optional but useful for LaTeX/Bib
brew "biber"
brew "bib-tool"

# Optional: if you use pandoc from terminal or keymaps
brew "pandoc"
